IDENTIFICATION DIVISION.
PROGRAM-ID. ZSKRECHNER.

DATA DIVISION.
WORKING-STORAGE SECTION.
    01 WS-KUH PIC 9(4) VALUE 2800.
    01 WS-SCHAF PIC 9(3) VALUE 650.
    01 WS-ZIEGE PIC 9(3) VALUE 500.
    01 WS-KLEINEZIEGE PIC 9(3) VALUE 50.
    01 WS-BETRAG PIC Z(8) VALUE 0.
    01 WS-REST PIC Z(8)9 VALUE 0.
    01 WS-ANZAHL PIC Z(3)9 VALUE 0.

PROCEDURE DIVISION.
    DISPLAY 'Willkommen beim ZSK-Rechner'.
    DISPLAY 'Bitte geben Sie einen Euro-Betrag ein:'.
    ACCEPT WS-BETRAG.
    DIVIDE WS-BETRAG BY WS-KUH GIVING WS-ANZAHL REMAINDER WS-REST.
    DISPLAY 'Sie bekommen 'WS-ANZAHL' Kühe'.
    DIVIDE WS-REST BY WS-SCHAF GIVING WS-Anzahl REMAINDER WS-REST.
    DISPLAY 'Sie bekommen 'WS-ANZAHL' Schafe'.
    DIVIDE WS-REST BY WS-ZIEGE GIVING WS-Anzahl REMAINDER WS-REST.
    DISPLAY 'Sie bekommen 'WS-ANZAHL' Ziegen'.
    DIVIDE WS-REST BY WS-KLEINEZIEGE GIVING WS-ANZAHL REMAINDER WS-REST.
    DISPLAY 'Sie bekommen 'WS-ANZAHL' kleine Ziegen'.
    DISPLAY 'Es bleiben 'WS-REST' Euro uebrig'.
STOP RUN.